# Напишите прогр. вычисления арифм. выражения заданного строкой.

str_inp1 = '2 + 2'
print(f'{str_inp1} = {eval(str_inp1)}')

str_inp2 = '1 + 2 * 3'
print(f'{str_inp2} = {eval(str_inp2)}')

str_inp3 = '1 - 2 * 3'
print(f'{str_inp3} = {eval(str_inp3)}')